app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test"], ["room_number", 434], ["created_at", "2020-04-19 21:08:23.905498"], ["updated_at", "2020-04-19 21:08:23.905498"]]
---
    def create
        # byebug
        @schoolclass = SchoolClass.new(post_params(:title, :room_number))
        @schoolclass.save